import Printf.println

현금 = 100_0000
예금 = 70_0000
현금성자산 = 현금 + 예금

"""
금융채권 = 받아야할 돈
매출채권 = 외상 판매 대금
"""
금융채권 = 매출채권 = 0

"선급비용 =  받아야하는 것들 (서비스, 물건 등)"
선급비용 = 0
재고 = 0

유동자산 = 현금성자산 + 금융채권 + 선급비용 + 재고

"고정자산 = 일정 기간 이상 소유하고 있는 자산"
고정자산 = 0
고정자산기준 = 12 # 한국 기준 12개월
무형자산 = 0

################################################################
자산 = 유동자산 + 고정자산 + 무형자산
################################################################
################################################################


"""
금융채무 = 값아야할 돈
매입채무 = 외상 구매 대금
"""
금융채무 = 매입채무 = 0

"선수수익 =  내야하는 것들 (서비스, 물건 등)"
선수수익 = 0

"""
충당부채 =  내야할 가능성이 높은 것들 (서비스, 물건 등)

Ex) 퇴직금
"""
충당부채 = 0

################################################################
부채 = 금융채무 + 선수수익 + 충당부채
################################################################
################################################################

capital = 자본 = 자산 - 부채
println("자본: ", 자본)

################################################################
# 한달 필요 현금 - 없으면 회사 망함 
################################################################
한달경비 = 20_0000
차입금상환원금 = 20_0000 # 갚아야할 돈
납세자금 = 5_0000
한달필요현금 = 한달경비 + 차입금상환원금 + 납세자금
################################################################
# Output
################################################################
목표현금보유개월수 = 6

println("#################################################")
println("한달 필요 현금: ", 한달필요현금, "₩")
println("현금성자산: ", 현금성자산, "₩")
println("#################################################")

목표보유금액 = 한달필요현금 * 목표현금보유개월수
if 한달필요현금 * 목표현금보유개월수 > 현금성자산
  println("#################################################")
  println("## [ERROR] ##")
  println("#################################################")
  println("현금성자산이 ", 목표현금보유개월수, "개월 치보다 부족합니다")
  println(목표현금보유개월수, "개월치: ", 목표보유금액, "₩")
  println("부족 금액: ", 목표보유금액 - 현금성자산, "₩")
  println("#################################################")
end

println("#################################################")
if 자본 <= 0
  println("## [적자] ##")
else
  println("## [흑자] ##")
end
println("##   자본: ", 자본, "₩")
println("#################################################")
